# PrintParameters Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InSessionPrintSetting..::..PrintParameters Property
InSessionPrintSetting Class See Also
---
Returns the Parameters of Print Setup.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual PrintParameters PrintParameters { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property PrintParameters As PrintParameters
	Get
```

Visual C++
---
```text
public:
virtual property PrintParameters^ PrintParameters {
	PrintParameters^ get ();
}
```

# ### Implements
IPrintSetting..::..PrintParameters
# Remarks
The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.
# See Also
InSessionPrintSetting Class
Autodesk.Revit.DB Namespace